spring/spring-security.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>spring-security</title>
<!-- 2017-11-12 Sun 19:31 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
</head>
<body>
<div id="content">
<h1 class="title">spring-security</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Authentication</a></li>
<li><a href="#sec-2">2. Authorization</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Authentication</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>SecurityContextHolder 如何维护threadlocal变量? 何时调用setContext? 何时调用clearContext?

<div class="org-src-container">

<pre class="src src-java"><span style="color: #0287c8; font-weight: bold;">Object</span> <span style="color: #4fa8a8;">principal</span> = SecurityContextHolder.getContext().getAuthentication().getPrincipal();

<span style="color: #989848;">if</span> (principal <span style="color: #989848;">instanceof</span> UserDetails) {
        <span style="color: #0287c8; font-weight: bold;">String</span> <span style="color: #4fa8a8;">username</span> = ((<span style="color: #0287c8; font-weight: bold;">UserDetails</span>)principal).getUsername();
} <span style="color: #989848;">else</span> {
        <span style="color: #0287c8; font-weight: bold;">String</span> <span style="color: #4fa8a8;">username</span> = principal.toString();
}
</pre>
</div>
</li>

<li>UserDetails

<div class="org-src-container">

<pre class="src src-java"><span style="color: #989848;">public</span> <span style="color: #989848;">interface</span> <span style="color: #0287c8; font-weight: bold;">UserDetails</span> <span style="color: #989848;">extends</span> <span style="color: #0287c8; font-weight: bold;">Serializable</span> {

    <span style="color: #0287c8; font-weight: bold;">Collection</span>&lt;? <span style="color: #989848;">extends</span> <span style="color: #0287c8; font-weight: bold;">GrantedAuthority</span>&gt; <span style="color: #424242; font-weight: bold;">getAuthorities</span>();


    <span style="color: #0287c8; font-weight: bold;">String</span> <span style="color: #424242; font-weight: bold;">getPassword</span>();


    <span style="color: #0287c8; font-weight: bold;">String</span> <span style="color: #424242; font-weight: bold;">getUsername</span>();


    <span style="color: #0287c8; font-weight: bold;">boolean</span> <span style="color: #424242; font-weight: bold;">isAccountNonExpired</span>();


    <span style="color: #0287c8; font-weight: bold;">boolean</span> <span style="color: #424242; font-weight: bold;">isAccountNonLocked</span>();


    <span style="color: #0287c8; font-weight: bold;">boolean</span> <span style="color: #424242; font-weight: bold;">isCredentialsNonExpired</span>();


    <span style="color: #0287c8; font-weight: bold;">boolean</span> <span style="color: #424242; font-weight: bold;">isEnabled</span>();
}
</pre>
</div>
</li>

<li>UserDetailsService

<div class="org-src-container">

<pre class="src src-java"><span style="color: #989848;">public</span> <span style="color: #989848;">interface</span> <span style="color: #0287c8; font-weight: bold;">UserDetailsService</span> {

    <span style="color: #0287c8; font-weight: bold;">UserDetails</span> <span style="color: #424242; font-weight: bold;">loadUserByUsername</span>(<span style="color: #0287c8; font-weight: bold;">String</span> <span style="color: #4fa8a8;">username</span>) <span style="color: #989848;">throws</span> <span style="color: #0287c8; font-weight: bold;">UsernameNotFoundException</span>;
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-xml">&lt;<span style="color: #424242; font-weight: bold;">authentication-manager</span>&gt;
   &lt;<span style="color: #424242; font-weight: bold;">authentication-provider</span> <span style="color: #4fa8a8;">user-service-ref</span>=<span style="color: #b85c57;">'</span><span style="color: #b85c57;">myUserDetailsService</span><span style="color: #b85c57;">'</span>/&gt;
&lt;/<span style="color: #424242; font-weight: bold;">authentication-manager</span>&gt;
</pre>
</div>
</li>

<li>Authentication

<div class="org-src-container">

<pre class="src src-java"><span style="color: #40883f;">/**</span>
<span style="color: #40883f;">    Represents the token for an authentication request or for an authenticated principal once the request has been processed by the AuthenticationManager.authenticate(Authentication) method.</span>

<span style="color: #40883f;">    Once the request has been authenticated, the Authentication will usually be stored in a thread-local SecurityContext managed by the SecurityContextHolder by the authentication mechanism which is being used. </span>
<span style="color: #40883f;">    An explicit authentication can be achieved, without using one of Spring Security's authentication mechanisms, by creating an Authentication instance and using the code:</span>

<span style="color: #40883f;">    SecurityContextHolder.getContext().setAuthentication(anAuthentication);</span>

<span style="color: #40883f;">    Note that unless the Authentication has the authenticated property set to true, it will still be authenticated by any security interceptor (for method or web invocations) which encounters it.</span>
<span style="color: #40883f;">    In most cases, the framework transparently takes care of managing the security context and authentication objects for you.</span>

<span style="color: #40883f;">*/</span>
<span style="color: #989848;">public</span> <span style="color: #989848;">interface</span> <span style="color: #0287c8; font-weight: bold;">Authentication</span> <span style="color: #989848;">extends</span> <span style="color: #0287c8; font-weight: bold;">Principal</span>, <span style="color: #0287c8; font-weight: bold;">Serializable</span> {

    <span style="color: #0287c8; font-weight: bold;">Collection</span>&lt;? <span style="color: #989848;">extends</span> <span style="color: #0287c8; font-weight: bold;">GrantedAuthority</span>&gt; <span style="color: #424242; font-weight: bold;">getAuthorities</span>();

    <span style="color: #40883f;">/* </span><span style="color: #40883f;">This is usually a password, but could be anything relevant to the AuthenticationManager  */</span>
    <span style="color: #0287c8; font-weight: bold;">Object</span> <span style="color: #424242; font-weight: bold;">getCredentials</span>();

    <span style="color: #40883f;">/* </span><span style="color: #40883f;">Stores additional details about the authentication request. These might be an IP address, certificate serial number etc.  */</span>
    <span style="color: #0287c8; font-weight: bold;">Object</span> <span style="color: #424242; font-weight: bold;">getDetails</span>();

    <span style="color: #40883f;">/* </span><span style="color: #40883f;">The identity of the principal being authenticated. In the case of an authentication request with username and password, this would be the username.   */</span>
    <span style="color: #0287c8; font-weight: bold;">Object</span> <span style="color: #424242; font-weight: bold;">getPrincipal</span>();


    <span style="color: #0287c8; font-weight: bold;">boolean</span> <span style="color: #424242; font-weight: bold;">isAuthenticated</span>();


    <span style="color: #0287c8; font-weight: bold;">void</span> <span style="color: #424242; font-weight: bold;">setAuthenticated</span>(<span style="color: #0287c8; font-weight: bold;">boolean</span> <span style="color: #4fa8a8;">isAuthenticated</span>) <span style="color: #989848;">throws</span> <span style="color: #0287c8; font-weight: bold;">IllegalArgumentException</span>;
}
</pre>
</div>
</li>

<li>GrantedAuthority

<div class="org-src-container">

<pre class="src src-java"><span style="color: #40883f;">/**</span>
<span style="color: #40883f;">   A GrantedAuthority is, not surprisingly, an authority that is granted to the principal. Such authorities are usually "roles", such as ROLE_ADMINISTRATOR or ROLE_HR_SUPERVISOR. </span>
<span style="color: #40883f;">   These roles are later on configured for web authorization, method authorization and domain object authorization. </span>
<span style="color: #40883f;">   Other parts of Spring Security are capable of interpreting these authorities, and expect them to be present. GrantedAuthority objects are usually loaded by the UserDetailsService.</span>
<span style="color: #40883f;">*/</span>
   <span style="color: #989848;">public</span> <span style="color: #989848;">interface</span> <span style="color: #0287c8; font-weight: bold;">GrantedAuthority</span> <span style="color: #989848;">extends</span> <span style="color: #0287c8; font-weight: bold;">Serializable</span> {

       <span style="color: #0287c8; font-weight: bold;">String</span> <span style="color: #424242; font-weight: bold;">getAuthority</span>();
   }
</pre>
</div>
</li>

<li>AuthenticationManager

<div class="org-src-container">

<pre class="src src-java"><span style="color: #989848;">public</span> <span style="color: #989848;">interface</span> <span style="color: #0287c8; font-weight: bold;">AuthenticationManager</span> {

    <span style="color: #40883f;">/**</span>
<span style="color: #40883f;">     Attempts to authenticate the passed Authentication object, returning a fully populated Authentication object (including granted authorities) if successful.</span>
<span style="color: #40883f;">     */</span>
    <span style="color: #0287c8; font-weight: bold;">Authentication</span> <span style="color: #424242; font-weight: bold;">authenticate</span>(<span style="color: #0287c8; font-weight: bold;">Authentication</span> <span style="color: #4fa8a8;">authentication</span>) <span style="color: #989848;">throws</span> <span style="color: #0287c8; font-weight: bold;">AuthenticationException</span>;
}
</pre>
</div>
</li>

<li>ExceptionTranslationFilter 默认的filterChain包含哪些filter? 顺序如何?

<pre class="example">
ExceptionTranslationFilter is a Spring Security filter that has responsibility for detecting any Spring Security exceptions that are thrown. 
Such exceptions will generally be thrown by an AbstractSecurityInterceptor, which is the main provider of authorization services. 
It handle these exceptions by either returning error code 403 or launching an AuthenticationEntryPoint.
</pre>
</li>

<li>AuthenticationEntryPoint

<div class="org-src-container">

<pre class="src src-java"><span style="color: #989848;">public</span> <span style="color: #0287c8; font-weight: bold;">void</span> <span style="color: #424242; font-weight: bold;">commence</span>(<span style="color: #0287c8; font-weight: bold;">HttpServletRequest</span> <span style="color: #4fa8a8;">request</span>, <span style="color: #0287c8; font-weight: bold;">HttpServletResponse</span> <span style="color: #4fa8a8;">response</span>, <span style="color: #0287c8; font-weight: bold;">AuthenticationException</span> <span style="color: #4fa8a8;">authException</span>)
        <span style="color: #989848;">throws</span> <span style="color: #0287c8; font-weight: bold;">IOException</span>, <span style="color: #0287c8; font-weight: bold;">ServletException</span> {
    response.addHeader(<span style="color: #b85c57;">"WWW-Authenticate"</span>, <span style="color: #b85c57;">"Basic realm=\""</span> + realmName + <span style="color: #b85c57;">"\""</span>);
    response.sendError(<span style="color: #989848; font-weight: bold;">HttpServletResponse</span>.SC_UNAUTHORIZED, authException.getMessage());
}
</pre>
</div>
</li>

<li>Authentication Mechanism 对应的类是什么?

<pre class="example">
Once your browser submits your authentication credentials (either as an HTTP form post or HTTP header) there needs to be something on the server that "collects" these authentication details.
In Spring Security we have a special name for the function of collecting authentication details from a user agent (usually a web browser), referring to it as the "authentication mechanism". 
Examples are form-base login and Basic authentication. Once the authentication details have been collected from the user agent, 
an Authentication "request" object is built and then presented to the AuthenticationManager.

After the authentication mechanism receives back the fully-populated Authentication object, it will deem the request valid, put the Authentication into the SecurityContextHolder, 
and cause the original request to be retried. If, on the other hand, the AuthenticationManager rejected the request, the authentication mechanism will ask the user agent to retry.
</pre>
</li>

<li>SecurityContextPersistenceFilter

<pre class="example">
Depending on the type of application, there may need to be a strategy in place to store the security context between user operations. 
In a typical web application, a user logs in once and is subsequently identified by their session Id. The server caches the principal information for the duration session. 
In Spring Security, the responsibility for storing the SecurityContext between requests falls to the SecurityContextPersistenceFilter, 
which by default stores the context as an HttpSession attribute between HTTP requests. It restores the context to the SecurityContextHolder for each request and, 
crucially, clears the SecurityContextHolder when the request completes.
</pre>
</li>
</ol>
</div>
</div>
