spring/spring-security.org
* Authorization

1. AccessDecisionManager
   #+BEGIN_SRC java

   public interface AccessDecisionManager {

       /**
        ,* Resolves an access control decision for the passed parameters.
        ,*
        ,* @param authentication the caller invoking the method (not null)
        ,* @param object the secured object being called
        ,* @param configAttributes the configuration attributes associated with the secured object being invoked
        ,*
        ,* @throws AccessDeniedException if access is denied as the authentication does not hold a required authority or
        ,*         ACL privilege
        ,* @throws InsufficientAuthenticationException if access is denied as the authentication does not provide a
        ,*         sufficient level of trust
        ,*/
       void decide(Authentication authentication, Object object, Collection<ConfigAttribute> configAttributes)
           throws AccessDeniedException, InsufficientAuthenticationException;

       /**
          Indicates whether this AccessDecisionManager is able to process authorization requests presented with the passed ConfigAttribute.
          This allows the AbstractSecurityInterceptor to check every configuration attribute can be consumed by the configured AccessDecisionManager and/or RunAsManager and/or AfterInvocationManager
        ,*/
       boolean supports(ConfigAttribute attribute);

       /* Indicates whether the AccessDecisionManager implementation is able to provide access control decisions for the indicated secured object type. */
       boolean supports(Class<?> clazz);
   }
      
   #+END_SRC

2. AbstractSecurityInterceptor
   
   #+begin_example

      Each supported secure object type has its own interceptor class, which is a subclass of AbstractSecurityInterceptor. 
   Importantly, by the time the AbstractSecurityInterceptor is called, the SecurityContextHolder will contain a valid Authentication if the principal has been authenticated.

   AbstractSecurityInterceptor provides a consistent workflow for handling secure object requests, typically:

   1) Look up the "configuration attributes" associated with the present request
   2) Submitting the secure object, current Authentication and configuration attributes to the AccessDecisionManager for an authorization decision
   3) Optionally change the Authentication under which the invocation takes place
   4) Allow the secure object invocation to proceed (assuming access was granted)
   5) Call the AfterInvocationManager if configured, once the invocation has returned. If the invocation raised an exception, the AfterInvocationManager will not be invoked.


    #+end_example

3. Configuration Attribute

   #+begin_example

   A "configuration attribute" can be thought of as a String that has special meaning to the classes used by AbstractSecurityInterceptor. 
   They are represented by the interface ConfigAttribute within the framework. They may be simple role names or have more complex meaning, 
   depending on the how sophisticated the AccessDecisionManager implementation is. The AbstractSecurityInterceptor is configured with a SecurityMetadataSource 
   which it uses to look up the attributes for a secure object. Usually this configuration will be hidden from the user. 
   Configuration attributes will be entered as annotations on secured methods or as access attributes on secured URLs. 
   For example, when we saw something like <intercept-url pattern='/secure/**' access='ROLE_A,ROLE_B'/> in the namespace introduction, 
   this is saying that the configuration attributes ROLE_A and ROLE_B apply to web requests matching the given pattern. 
   In practice, with the default AccessDecisionManager configuration, this means that anyone who has a GrantedAuthority matching either of these two attributes will be allowed access. 
   Strictly speaking though, they are just attributes and the interpretation is dependent on the AccessDecisionManager implementation. 
   The use of the prefix ROLE_ is a marker to indicate that these attributes are roles and should be consumed by Spring Security’s RoleVoter. 
   This is only relevant when a voter-based AccessDecisionManager is in use.

   #+end_example

4. RunAsManager

   #+begin_example

   Assuming AccessDecisionManager decides to allow the request, the AbstractSecurityInterceptor will normally just proceed with the request. 
   Having said that, on rare occasions users may want to replace the Authentication inside the SecurityContext with a different Authentication, 
   which is handled by the AccessDecisionManager calling a RunAsManager. This might be useful in reasonably unusual situations, 
   such as if a services layer method needs to call a remote system and present a different identity. 
   Because Spring Security automatically propagates security identity from one server to another (assuming you’re using a properly-configured RMI or HttpInvoker remoting protocol client), 
   this may be useful.

   #+end_example

5. ProviderManager and AuthenticationProvider

   #+begin_example

   The default implementation in Spring Security is called ProviderManager and rather than handling the authentication request itself, 
   it delegates to a list of configured AuthenticationProviders, each of which is queried in turn to see if it can perform the authentication. 
   Each provider will either throw an exception or return a fully populated Authentication object. 

   #+end_example




