spring/spring-security.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Authorization</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>AccessDecisionManager
<div class="org-src-container">

<pre class="src src-java"><span style="color: #989848;">public</span> <span style="color: #989848;">interface</span> <span style="color: #0287c8; font-weight: bold;">AccessDecisionManager</span> {

    <span style="color: #40883f;">/**</span>
<span style="color: #40883f;">     * Resolves an access control decision for the passed parameters.</span>
<span style="color: #40883f;">     *</span>
<span style="color: #40883f;">     * </span><span style="color: #989848; font-weight: bold;">@param</span><span style="color: #40883f;"> authentication the caller invoking the method (not null)</span>
<span style="color: #40883f;">     * </span><span style="color: #989848; font-weight: bold;">@param</span><span style="color: #40883f;"> object the secured object being called</span>
<span style="color: #40883f;">     * </span><span style="color: #989848; font-weight: bold;">@param</span><span style="color: #40883f;"> configAttributes the configuration attributes associated with the secured object being invoked</span>
<span style="color: #40883f;">     *</span>
<span style="color: #40883f;">     * </span><span style="color: #989848; font-weight: bold;">@throws</span><span style="color: #40883f;"> AccessDeniedException if access is denied as the authentication does not hold a required authority or</span>
<span style="color: #40883f;">     *         ACL privilege</span>
<span style="color: #40883f;">     * </span><span style="color: #989848; font-weight: bold;">@throws</span><span style="color: #40883f;"> InsufficientAuthenticationException if access is denied as the authentication does not provide a</span>
<span style="color: #40883f;">     *         sufficient level of trust</span>
<span style="color: #40883f;">     */</span>
    <span style="color: #0287c8; font-weight: bold;">void</span> <span style="color: #424242; font-weight: bold;">decide</span>(<span style="color: #0287c8; font-weight: bold;">Authentication</span> <span style="color: #4fa8a8;">authentication</span>, <span style="color: #0287c8; font-weight: bold;">Object</span> <span style="color: #4fa8a8;">object</span>, <span style="color: #0287c8; font-weight: bold;">Collection</span>&lt;<span style="color: #0287c8; font-weight: bold;">ConfigAttribute</span>&gt; <span style="color: #4fa8a8;">configAttributes</span>)
        <span style="color: #989848;">throws</span> <span style="color: #0287c8; font-weight: bold;">AccessDeniedException</span>, <span style="color: #0287c8; font-weight: bold;">InsufficientAuthenticationException</span>;

    <span style="color: #40883f;">/**</span>
<span style="color: #40883f;">       Indicates whether this AccessDecisionManager is able to process authorization requests presented with the passed ConfigAttribute.</span>
<span style="color: #40883f;">       This allows the AbstractSecurityInterceptor to check every configuration attribute can be consumed by the configured AccessDecisionManager and/or RunAsManager and/or AfterInvocationManager</span>
<span style="color: #40883f;">     */</span>
    <span style="color: #0287c8; font-weight: bold;">boolean</span> <span style="color: #424242; font-weight: bold;">supports</span>(<span style="color: #0287c8; font-weight: bold;">ConfigAttribute</span> <span style="color: #4fa8a8;">attribute</span>);

    <span style="color: #40883f;">/* </span><span style="color: #40883f;">Indicates whether the AccessDecisionManager implementation is able to provide access control decisions for the indicated secured object type. */</span>
    <span style="color: #0287c8; font-weight: bold;">boolean</span> <span style="color: #424242; font-weight: bold;">supports</span>(<span style="color: #0287c8; font-weight: bold;">Class</span>&lt;?&gt; <span style="color: #4fa8a8;">clazz</span>);
}
</pre>
</div>
</li>

<li>AbstractSecurityInterceptor

<pre class="example">
   Each supported secure object type has its own interceptor class, which is a subclass of AbstractSecurityInterceptor. 
Importantly, by the time the AbstractSecurityInterceptor is called, the SecurityContextHolder will contain a valid Authentication if the principal has been authenticated.

AbstractSecurityInterceptor provides a consistent workflow for handling secure object requests, typically:

1) Look up the "configuration attributes" associated with the present request
2) Submitting the secure object, current Authentication and configuration attributes to the AccessDecisionManager for an authorization decision
3) Optionally change the Authentication under which the invocation takes place
4) Allow the secure object invocation to proceed (assuming access was granted)
5) Call the AfterInvocationManager if configured, once the invocation has returned. If the invocation raised an exception, the AfterInvocationManager will not be invoked.
</pre>
</li>

<li>Configuration Attribute

<pre class="example">
A "configuration attribute" can be thought of as a String that has special meaning to the classes used by AbstractSecurityInterceptor. 
They are represented by the interface ConfigAttribute within the framework. They may be simple role names or have more complex meaning, 
depending on the how sophisticated the AccessDecisionManager implementation is. The AbstractSecurityInterceptor is configured with a SecurityMetadataSource 
which it uses to look up the attributes for a secure object. Usually this configuration will be hidden from the user. 
Configuration attributes will be entered as annotations on secured methods or as access attributes on secured URLs. 
For example, when we saw something like &lt;intercept-url pattern='/secure/**' access='ROLE_A,ROLE_B'/&gt; in the namespace introduction, 
this is saying that the configuration attributes ROLE_A and ROLE_B apply to web requests matching the given pattern. 
In practice, with the default AccessDecisionManager configuration, this means that anyone who has a GrantedAuthority matching either of these two attributes will be allowed access. 
Strictly speaking though, they are just attributes and the interpretation is dependent on the AccessDecisionManager implementation. 
The use of the prefix ROLE_ is a marker to indicate that these attributes are roles and should be consumed by Spring Security’s RoleVoter. 
This is only relevant when a voter-based AccessDecisionManager is in use.
</pre>
</li>

<li>RunAsManager

<pre class="example">
Assuming AccessDecisionManager decides to allow the request, the AbstractSecurityInterceptor will normally just proceed with the request. 
Having said that, on rare occasions users may want to replace the Authentication inside the SecurityContext with a different Authentication, 
which is handled by the AccessDecisionManager calling a RunAsManager. This might be useful in reasonably unusual situations, 
such as if a services layer method needs to call a remote system and present a different identity. 
Because Spring Security automatically propagates security identity from one server to another (assuming you’re using a properly-configured RMI or HttpInvoker remoting protocol client), 
this may be useful.
</pre>
</li>

<li>ProviderManager and AuthenticationProvider

<pre class="example">
The default implementation in Spring Security is called ProviderManager and rather than handling the authentication request itself, 
it delegates to a list of configured AuthenticationProviders, each of which is queried in turn to see if it can perform the authentication. 
Each provider will either throw an exception or return a fully populated Authentication object.
</pre>
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2017-11-12 Sun 19:31</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>